#+TITLE: Bi-invertible Maps
#+NAME: BiInv
#+AUTHOR: Johann Rosain

* Bi-invertible maps

  #+begin_src ctt
  module Lib.Data.BiInv where
  #+end_src

This file defines accessors of bi-invertible maps.

** Packages imports

The imported packages can be accessed via the following links:
   - [[file:Map.org][Lib/Data/Map]]
   #+begin_src ctt
  import Stdlib.Prelude
  import Lib.Data.Map  
   #+end_src

** =is-bi-inv= accessors
*** Of the left & right inverses

   #+begin_src ctt
  is-bi-inv/right-inv (A B : U) (f : A -> B) (b : is-bi-inv A B f) : B -> A =
    b.1.1

  is-bi-inv/left-inv (A B : U) (f : A -> B) (b : is-bi-inv A B f) : B -> A =
    b.2.1  
   #+end_src

*** Of the left & right homotopies

    #+begin_src ctt
  is-bi-inv/right-htpy (A B : U) (f : A -> B) (b : is-bi-inv A B f) : Htpy B (\ _. B) (map/comp B A B f (is-bi-inv/right-inv A B f b)) (id B) =
    b.1.2

  is-bi-inv/left-htpy (A B : U) (f : A -> B) (b : is-bi-inv A B f) : Htpy A (\ _. A) (map/comp A B A (is-bi-inv/left-inv A B f b) f) (id A) =
    b.2.2
    #+end_src

#+RESULTS:
: Typecheck has succeeded.

** =BiInv= accessors
*** Of the underlying constructions
    #+begin_src ctt
  BiInv/map (A B : U) (b : BiInv A B) : A -> B =
    b.1

  BiInv/is-bi-inv (A B : U) (b : BiInv A B) : is-bi-inv A B (BiInv/map A B b) =
    b.2
    #+end_src
*** Of the left & right inverses
    #+begin_src ctt
  BiInv/right-inv (A B : U) (b : BiInv A B) : B -> A =
    is-bi-inv/right-inv A B (BiInv/map A B b) (BiInv/is-bi-inv A B b)

  BiInv/left-inv (A B : U) (b : BiInv A B) : B -> A =
    is-bi-inv/left-inv A B (BiInv/map A B b) (BiInv/is-bi-inv A B b)
    #+end_src
*** Of the left & right homotopies
    #+begin_src ctt
  BiInv/right-htpy (A B : U) (b : BiInv A B) : Htpy B (\ _. B) (map/comp B A B (BiInv/map A B b) (BiInv/right-inv A B b)) (id B) =
    is-bi-inv/right-htpy A B (BiInv/map A B b) (BiInv/is-bi-inv A B b)

  BiInv/left-htpy (A B : U) (b : BiInv A B) : Htpy A (\ _. A) (map/comp A B A (BiInv/left-inv A B b) (BiInv/map A B b)) (id A) =
    is-bi-inv/left-htpy A B (BiInv/map A B b) (BiInv/is-bi-inv A B b)
    #+end_src

#+RESULTS:
: Typecheck has succeeded.
